План_полетов_файловый_edt/src/Documents/ДанныеСОП/ДанныеСОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеСОП</name>
  <registerRecords>InformationRegister.СоздателиФормаС</registerRecords>
  <registerRecords>InformationRegister.СвязьДанныеСОППрилетВылет</registerRecords>
  <registerRecords>InformationRegister.ОтветственныеФормаС</registerRecords>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Прилеты</types>
      <types>DocumentRef.Вылеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
</mdclass:Document>

План_полетов_файловый_edt/src/InformationRegisters/ОтветственныеФормаС/ОтветственныеФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеФормаС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ФормаС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/InformationRegisters/СоздателиФормаС/СоздателиФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоздателиФормаС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ФормаС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/InformationRegisters/СвязьДанныеСОППрилетВылет/СвязьДанныеСОППрилетВылет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьДанныеСОППрилетВылет</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПрилетВылет</name>
    <type>
      <types>DocumentRef.Прилеты</types>
      <types>DocumentRef.Вылеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/Documents/ДанныеСОП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОтветственныеФормаС.Записывать = Истина;
	Движение = Движения.ОтветственныеФормаС.Добавить();
	Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Движение.Документ = Ссылка;
	Движение.Дата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоздателиФормаС.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.СоздателиФормаС КАК СоздателиФормаС
	|ГДЕ
	|	СоздателиФормаС.Документ = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		движения.СоздателиФормаС.Записывать = Истина;
		Движение = Движения.СоздателиФормаС.Добавить();
		Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Движение.Документ = Ссылка;
		Движение.Дата = ТекущаяДата();	
	КонецЕсли;
	Движения.СвязьДанныеСОППрилетВылет.Записывать = Истина;
	Движение = Движения.СвязьДанныеСОППрилетВылет.Добавить();
	Движение.ПрилетВылет = Документ;
	Движение.ПассажирыВзрослые = ПассажирыВзрослые;
	Движение.ПассажирыДети = ПассажирыДети;
	Движение.ПассажирыМалыши = ПассажирыМалыши;
	Движение.РучнаяКладь = РучнаяКладь;
	Движение.Багаж = Багаж;
	Движение.Почта = Почта;
	Движение.Груз = Груз;
	Движение.VIPПассажирыВзрослые = VIPПассажирыВзрослые;
	Движение.VIPПассажирыДети = VIPПассажирыДети;
КонецПроцедуры
